Core/src/Documents/РасспределениеЗатратНаТовары/РасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасспределениеЗатратНаТовары</name>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccumulationRegister.Запасы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ВнеоборотныеАктивы</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасспределениеЗатратНаТовары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратТек</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаТек</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглТек</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииТек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаНов</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииНов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиНов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПереоценкиРеглНов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюВТекущемМесяцеНов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельностиТек</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоСчетам</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто1</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто2</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто3</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКотроль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровНаСкладе</name>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Себистоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/ДоходыИРасходы/ДоходыИРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоходыИРасходы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика</name>
    <type>
      <types>Characteristic.АналитикаДоходовИРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ВидыОперацийРасспределениеЗатратНаТовары/ВидыОперацийРасспределениеЗатратНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасспределениеЗатратНаТовары</name>
  <enumValues>
    <name>НаТовары</name>
  </enumValues>
  <enumValues>
    <name>НаИмущество</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/РасспределениеЗатратНаТовары/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.Ссылка,
		|	РасспределениеЗатратНаТовары.Номер,
		|	РасспределениеЗатратНаТовары.Дата,
		|	РасспределениеЗатратНаТовары.ДатаНачала,
		|	РасспределениеЗатратНаТовары.ДатаОкончания,
		|	РасспределениеЗатратНаТовары.Организация
		|ПОМЕСТИТЬ ВременнаяТаблицаШапка
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|ГДЕ
		|	РасспределениеЗатратНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СчетУчета,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто1,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто2,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.ВидСубконто3,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Подразделение,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Сумма
		|ПОМЕСТИТЬ ВременнаяТаблицаОборотыПоСчетам
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиПоСчетам КАК РасспределениеЗатратНаТоварыОстаткиПоСчетам
		|ГДЕ
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.НомерСтроки,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.Организация КАК Организация,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.Дата КАК Период,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Отметка,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Склад,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Номенклатура,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Характеристика,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Количество,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Себистоимость,
		|	&ВалютаУчета КАК Валюта,
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.СуммаРасходов КАК СуммаРасходов
		|ПОМЕСТИТЬ ВременнаяТаблицаОстаткиТоваров
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиТоваровНаСкладе КАК РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе
		|ГДЕ
		|	РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Отметка
		|	И РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка = &Ссылка
		|	И РасспределениеЗатратНаТоварыОстаткиТоваровНаСкладе.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.ОбъемПродукцииРаботДляВычисленияАмортизацииНов КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СрокИспользованияДляВычисленияАмортизацииНов КАК СрокИспользованияДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СчетЗатратНов КАК СчетЗатрат,
		|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиницаНов КАК СтруктурнаяЕдиница,
		|	РасспределениеЗатратНаТовары.НаправлениеДеятельностиТек КАК НаправлениеДеятельности,
		|	РасспределениеЗатратНаТовары.СчетЗатратРеглНов КАК СчетЗатратРегл,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов КАК СтоимостьДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов - РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииТек КАК РазницаСтоимости,
		|	РасспределениеЗатратНаТовары.НачислятьАмортизациюВТекущемМесяцеНов КАК ПрименитьВТекущемМесяце,
		|	РасспределениеЗатратНаТовары.Организация,
		|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
		|	РасспределениеЗатратНаТовары.Ссылка КАК Ссылка,
		|	&ВалютаУчета КАК Валюта,
		|	РасспределениеЗатратНаТовары.Дата КАК Период
		|ПОМЕСТИТЬ ВременнаяТаблицаИмущество
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|ГДЕ
		|	РасспределениеЗатратНаТовары.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
		|	И РасспределениеЗатратНаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.ОбъемПродукцииРаботДляВычисленияАмортизацииНов КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СрокИспользованияДляВычисленияАмортизацииНов КАК СрокИспользованияДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СчетЗатратНов КАК СчетЗатрат,
		|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиницаНов КАК СтруктурнаяЕдиница,
		|	РасспределениеЗатратНаТовары.НаправлениеДеятельностиТек КАК НаправлениеДеятельности,
		|	РасспределениеЗатратНаТовары.СчетЗатратРеглНов КАК СчетДт,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов КАК СтоимостьДляВычисленияАмортизации,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииНов - РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизацииТек КАК РазницаСтоимости,
		//|	РасспределениеЗатратНаТовары.СчетПереоценкиНов КАК СчетПереоценки,
		//|	РасспределениеЗатратНаТовары.СчетПереоценкиРеглНов КАК СчетПереоценкиРегл,
		|	РасспределениеЗатратНаТовары.НачислятьАмортизациюВТекущемМесяцеНов КАК ПрименитьВТекущемМесяце,
		|	РасспределениеЗатратНаТовары.Организация,
		|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
		|	РасспределениеЗатратНаТовары.Дата КАК Период,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СчетУчета КАК СчетКт,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.Сумма,
		|	РасспределениеЗатратНаТоварыОстаткиПоСчетам.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница_Подразделение,
		|	&ВалютаУчета КАК Валюта
		|ПОМЕСТИТЬ ВременнаяТаблицаИмуществоДляХозрасчетного
		|ИЗ
		|	Документ.РасспределениеЗатратНаТовары.ОстаткиПоСчетам КАК РасспределениеЗатратНаТоварыОстаткиПоСчетам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасспределениеЗатратНаТовары КАК РасспределениеЗатратНаТовары
		|		ПО РасспределениеЗатратНаТоварыОстаткиПоСчетам.Ссылка = РасспределениеЗатратНаТовары.Ссылка
		|ГДЕ
		|	РасспределениеЗатратНаТовары.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
		|	И РасспределениеЗатратНаТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 		ДокументСсылкаРасспределениеЗатратНаТовары);
	Запрос.УстановитьПараметр("ВалютаУчета", 		УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	Запрос.Выполнить();
	
	СформироватьВременнаяТаблицаВычислениеДолиСуммРаспределения(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьВременнаяТаблицаОпределенияСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьВременнаяТаблицаДанныхСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_РасспределениеЗатратНаТовары(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
	СформироватьТаблицаЗапасы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	//СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СодержаниеПроводки", НСТР("ka='Расспределение затрат';ru='Расспределение затрат';en='ALLOTMENT costs'"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК КоррСтруктурнаяЕдиница,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл.СчетАналогУУ
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл.СчетАналогУУ
	|	КОНЕЦ КАК СчетУчета,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗатратРегл КАК СчетУчетаЗатратРегл,
	|	ТаблицаДокумента.СчетУчета КАК КоррСчетУчетаРегл,
	|	ТаблицаДокумента.СчетУчета.СчетАналогУУ КАК КоррСчетУчета,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Номенклатура КАК КоррНоменклатура,
	|	ТаблицаДокумента.Характеристика КАК КоррХарактеристика,
	|	0 КАК Количество,
	|	&СодержаниеПроводки КАК СодержаниеПроводки,
	|	ТаблицаДокумента.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка),//ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.СчетУчета.СчетАналогУУ,
	|	ТаблицаДокумента.СчетУчета,
	|	NULL,
	|	NULL,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасов,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),//ТаблицаДокумента.Характеристика,
	|	ТаблицаДокумента.Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),//ТаблицаДокумента.Характеристика,
	|	0,
	|	&СодержаниеПроводки,
	|	ТаблицаДокумента.Сумма
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента
	|ГДЕ
	|	(ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|			ИЛИ ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасы()

// Подготовка таблицы для определения Субконто
// в колонках временной таблицы на выходе должны быть СчетДт, СчетКт и колонки с именами всех сумконто
Процедура СформироватьВременнаяТаблицаОпределенияСубконто(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаТовары)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл
	|		КОГДА ТаблицаДокумента.Ссылка.ВидОперации = ЗНАЧЕНИЕ(ПЕРеЧИСЛЕНИЕ.ВидыОперацийРасспределениеЗатратНаТовары.НаИмущество)
	|			ТОГДА ТаблицаДокумента.Номенклатура.СчетУчетаРегл
	|	КОНЕЦ КАК СчетДт,
	|	ТаблицаДокумента.СчетУчета КАК СчетКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Валюта КАК Валюта,
	|	НЕОПРЕДЕЛЕНО КАК ПродавцыДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК ПодразделенияДт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПокупателяДт,
	|	ТаблицаДокумента.Валюта КАК ВалютыДт,
	|	НЕОПРЕДЕЛЕНО КАК СотрудникиДт,
	|	ТаблицаДокумента.Номенклатура КАК СотрудникНоменклатураДт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыСотрудникиДт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыДт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПоставщикаДт,
	|	ТаблицаДокумента.Номенклатура КАК НоменклатураДт,
	|	ТаблицаДокумента.Характеристика КАК ХарактеристикиНоменклатурыДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ОбособленныеПодразделенияДт,
	|	ТаблицаДокумента.Номенклатура КАК ПродукцияДт,
	|	НЕОПРЕДЕЛЕНО КАК БанковскиеСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК КассаДт,
	|	НЕОПРЕДЕЛЕНО КАК СтавкиНДФЛДт,
	|	ТаблицаДокумента.Ссылка КАК ДокументДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СкладыДт,
	|	НЕОПРЕДЕЛЕНО КАК ТипыСуммГрафикаКредитовИЗаймовДт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКредитовИЗаймовДт,
	|	НЕОПРЕДЕЛЕНО КАК НомераГТДДт,
	|	НЕОПРЕДЕЛЕНО КАК РаботникиОрганизацийДт,
	|	НЕОПРЕДЕЛЕНО КАК СтатьиДвиженияДенежныхСредствДт,
	|	ТаблицаДокумента.Номенклатура КАК ИмуществоДт,
	|	НЕОПРЕДЕЛЕНО КАК ДокументыРасчетовСКонтрагентамиДт,
	|	НЕОПРЕДЕЛЕНО КАК ПартииДт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыДт,
	|	ТаблицаДокумента.Номенклатура КАК ОСТСДт,
	|	НЕОПРЕДЕЛЕНО КАК ПродавцыКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ПодразделенияКт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПокупателяКт,
	|	ТаблицаДокумента.Валюта КАК ВалютыКт,
	|	НЕОПРЕДЕЛЕНО КАК СотрудникиКт,
	|	ТаблицаДокумента.Номенклатура КАК СотрудникНоменклатураКт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыСотрудникиКт,
	|	НЕОПРЕДЕЛЕНО КАК КонтрагентыКт,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураПоставщикаКт,
	|	ТаблицаДокумента.Номенклатура КАК НоменклатураКт,
	|	ТаблицаДокумента.Характеристика КАК ХарактеристикиНоменклатурыКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК ОбособленныеПодразделенияКт,
	|	ТаблицаДокумента.Номенклатура КАК ПродукцияКт,
	|	НЕОПРЕДЕЛЕНО КАК БанковскиеСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК КассаКт,
	|	НЕОПРЕДЕЛЕНО КАК СтавкиНДФЛКт,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Склад КАК СкладыКт,
	|	НЕОПРЕДЕЛЕНО КАК ТипыСуммГрафикаКредитовИЗаймовКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКредитовИЗаймовКт,
	|	НЕОПРЕДЕЛЕНО КАК НомераГТДКт,
	|	НЕОПРЕДЕЛЕНО КАК РаботникиОрганизацийКт,
	|	НЕОПРЕДЕЛЕНО КАК СтатьиДвиженияДенежныхСредствКт,
	|	ТаблицаДокумента.Номенклатура КАК ИмуществоКт,
	|	НЕОПРЕДЕЛЕНО КАК ДокументыРасчетовСКонтрагентамиКт,
	|	ТаблицаДокумента.Ссылка КАК ДокументКт,
	|	НЕОПРЕДЕЛЕНО КАК ПартииКт,
	|	НЕОПРЕДЕЛЕНО КАК ДоговорыКт,
	|	ТаблицаДокумента.Номенклатура КАК ОСТСКт
	|ПОМЕСТИТЬ ВременнаяТаблицаОпределенияСубконто
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура СформироватьВременнаяТаблицаВычислениеДолиСуммРаспределения(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВременнаяТаблицаОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблицаОстаткиТоваров.Характеристика КАК Характеристика,
		|	ВременнаяТаблицаОстаткиТоваров.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
		|	ВременнаяТаблицаОстаткиТоваров.Количество КАК Количество,
		|	ВременнаяТаблицаОстаткиТоваров.Себистоимость КАК Себистоимость,
		|	ВременнаяТаблицаОстаткиТоваров.Ссылка КАК Ссылка,
		|	ВременнаяТаблицаОстаткиТоваров.Организация КАК Организация,
		|	ВременнаяТаблицаОстаткиТоваров.Период КАК Период,
		|	ВременнаяТаблицаОстаткиТоваров.Валюта КАК Валюта,
		|	ВременнаяТаблицаОстаткиТоваров.СуммаРасходов КАК СуммаРасходов
		|ПОМЕСТИТЬ ВТ_ОстаткиТоваров
		|ИЗ
		|	ВременнаяТаблицаОстаткиТоваров КАК ВременнаяТаблицаОстаткиТоваров
		|ГДЕ
		|	ВременнаяТаблицаОстаткиТоваров.Отметка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасспределениеЗатратНаТовары.ВнеоборотныйАктив,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	РасспределениеЗатратНаТовары.СтруктурнаяЕдиница,
		|	1,
		|	РасспределениеЗатратНаТовары.СтоимостьДляВычисленияАмортизации - РасспределениеЗатратНаТовары.РазницаСтоимости,
		|	РасспределениеЗатратНаТовары.Ссылка,
		|	РасспределениеЗатратНаТовары.Организация,
		|	РасспределениеЗатратНаТовары.Период,
		|	РасспределениеЗатратНаТовары.Валюта,
		|	РасспределениеЗатратНаТовары.РазницаСтоимости
		|ИЗ
		|	ВременнаяТаблицаИмущество КАК РасспределениеЗатратНаТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаОборотыПоСчетам.СчетУчета КАК СчетУчета,
		|	ВременнаяТаблицаОборотыПоСчетам.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
		|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто1 КАК ВидСубконто1,
		|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто2 КАК ВидСубконто2,
		|	ВременнаяТаблицаОборотыПоСчетам.ВидСубконто3 КАК ВидСубконто3,
		|	ВЫРАЗИТЬ(ВременнаяТаблицаОборотыПоСчетам.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма
		|ПОМЕСТИТЬ ВТ_Обороты
		|ИЗ
		|	ВременнаяТаблицаОборотыПоСчетам КАК ВременнаяТаблицаОборотыПоСчетам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Обороты.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ОборотыГрупп
		|ИЗ
		|	ВТ_Обороты КАК ВТ_Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиТоваров.Характеристика КАК Характеристика,
		|	ВТ_ОстаткиТоваров.СуммаРасходов КАК СуммаРасходов,
		|	ВТ_Обороты.СчетУчета КАК СчетУчета,
		|	ВТ_Обороты.Сумма КАК СуммаПоСчету,
		|	ВТ_ОборотыГрупп.Сумма КАК СуммаГрупп,
		|	ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов КАК Коэф,
		|	ВЫРАЗИТЬ(ВТ_Обороты.Сумма / (ВТ_ОборотыГрупп.Сумма / ВТ_ОстаткиТоваров.СуммаРасходов) КАК ЧИСЛО(15, 2)) КАК ЧастьСуммы,
		|	ВТ_Обороты.СтруктурнаяЕдиница_Подразделение,
		|	ВТ_Обороты.ВидСубконто1,
		|	ВТ_Обороты.ВидСубконто2,
		|	ВТ_Обороты.ВидСубконто3,
		|	ВТ_ОстаткиТоваров.СтруктурнаяЕдиница_Склад,
		|	ВТ_ОстаткиТоваров.Количество,
		|	ВТ_ОстаткиТоваров.Себистоимость,
		|	ВТ_ОстаткиТоваров.Валюта,
		|	ВТ_ОстаткиТоваров.Организация,
		|	ВТ_ОстаткиТоваров.Период,
		|	ВТ_ОстаткиТоваров.Ссылка
		|ПОМЕСТИТЬ ВТРаспред
		|ИЗ
		|	ВТ_ОстаткиТоваров КАК ВТ_ОстаткиТоваров,
		|	ВТ_Обороты КАК ВТ_Обороты,
		|	ВТ_ОборотыГрупп КАК ВТ_ОборотыГрупп
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТРаспред.ЧастьСуммы) КАК МаксЧасть,
		|	ВТРаспред.СуммаПоСчету,
		|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
		|	ВТРаспред.СуммаПоСчету - СУММА(ВТРаспред.ЧастьСуммы) КАК Разница,
		|	ВТРаспред.СчетУчета
		|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка
		|ИЗ
		|	ВТРаспред КАК ВТРаспред
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРаспред.СуммаПоСчету,
		|	ВТРаспред.СчетУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РаспредГруппПроверка.МаксЧасть КАК МаксЧасть,
		|	ВТ_РаспредГруппПроверка.СуммаПоСчету КАК СуммаПоСчету,
		|	ВТ_РаспредГруппПроверка.ЧастьСуммы КАК ЧастьСуммы,
		|	ВТ_РаспредГруппПроверка.Разница КАК Разница,
		|	ВТ_РаспредГруппПроверка.СчетУчета КАК СчетУчета,
		|	ВТРаспред.Номенклатура КАК Номенклатура,
		|	ВТРаспред.Характеристика КАК Характеристика,
		|	МАКСИМУМ(ВТРаспред.Себистоимость) КАК Себистоимость
		|ПОМЕСТИТЬ ВТ_РаспредГруппПроверка2
		|ИЗ
		|	ВТ_РаспредГруппПроверка КАК ВТ_РаспредГруппПроверка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаспред КАК ВТРаспред
		|		ПО ВТ_РаспредГруппПроверка.СуммаПоСчету = ВТРаспред.СуммаПоСчету
		|			И ВТ_РаспредГруппПроверка.МаксЧасть = ВТРаспред.ЧастьСуммы
		|			И ВТ_РаспредГруппПроверка.СчетУчета = ВТРаспред.СчетУчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_РаспредГруппПроверка.МаксЧасть,
		|	ВТ_РаспредГруппПроверка.СуммаПоСчету,
		|	ВТ_РаспредГруппПроверка.ЧастьСуммы,
		|	ВТ_РаспредГруппПроверка.Разница,
		|	ВТ_РаспредГруппПроверка.СчетУчета,
		|	ВТРаспред.Номенклатура,
		|	ВТРаспред.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРаспред.Номенклатура КАК Номенклатура,
		|	ВТРаспред.Характеристика КАК Характеристика,
		|	МИНИМУМ(ВТРаспред.ЧастьСуммы) КАК МинимальнаяЧасть,
		|	СУММА(ВТРаспред.ЧастьСуммы) КАК ЧастьСуммы,
		|	ВТРаспред.СчетУчета,
		|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
		|	ВТРаспред.ВидСубконто1,
		|	ВТРаспред.ВидСубконто2,
		|	ВТРаспред.ВидСубконто3,
		|	ВТРаспред.СтруктурнаяЕдиница_Склад,
		|	ВТРаспред.Количество,
		|	ВТРаспред.Себистоимость,
		|	ВТРаспред.Валюта
		|ПОМЕСТИТЬ ВТ_РаспредГрупп
		|ИЗ
		|	ВТРаспред КАК ВТРаспред
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРаспред.Номенклатура,
		|	ВТРаспред.Характеристика,
		|	ВТРаспред.СчетУчета,
		|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
		|	ВТРаспред.ВидСубконто3,
		|	ВТРаспред.СтруктурнаяЕдиница_Склад,
		|	ВТРаспред.ВидСубконто1,
		|	ВТРаспред.ВидСубконто2,
		|	ВТРаспред.Количество,
		|	ВТРаспред.Себистоимость,
		|	ВТРаспред.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРаспред.Номенклатура КАК Номенклатура,
		|	ВТРаспред.Характеристика КАК Характеристика,
		|	ВТРаспред.СуммаРасходов КАК СуммаРасходов,
		|	ВТРаспред.СчетУчета КАК СчетУчета,
		|	ВТРаспред.СуммаПоСчету КАК СуммаПоСчету,
		|	ВТРаспред.СуммаГрупп КАК СуммаГрупп,
		|	ВТРаспред.Коэф КАК Коэф,
		|	ВТРаспред.ЧастьСуммы КАК ЧастьСуммы,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|	КОНЕЦ КАК СуммаПоСчетуРаспределение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
		|			ТОГДА ВТРаспред.ЧастьСуммы
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|							ТОГДА ВТРаспред.СуммаПоСчету
		|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|					КОНЕЦ = 0
		|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
		|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|							ТОГДА ВТРаспред.СуммаПоСчету
		|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|					КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ КАК СуммаПропрорция,
		|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
		|	ВТРаспред.ВидСубконто1,
		|	ВТРаспред.ВидСубконто2,
		|	ВТРаспред.ВидСубконто3,
		|	ВТРаспред.СтруктурнаяЕдиница_Склад,
		|	ВТРаспред.Количество,
		|	ВТРаспред.Себистоимость,
		|	ВТРаспред.Валюта,
		|	ВТРаспред.Организация,
		|	ВТРаспред.Период,
		|	ВТРаспред.Ссылка
		|ПОМЕСТИТЬ ВТ_РасчетФинал
		|ИЗ
		|	ВТРаспред КАК ВТРаспред
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГрупп КАК ВТ_РаспредГрупп
		|		ПО ВТРаспред.Номенклатура = ВТ_РаспредГрупп.Номенклатура
		|			И ВТРаспред.Характеристика = ВТ_РаспредГрупп.Характеристика
		|			И ВТРаспред.ЧастьСуммы = ВТ_РаспредГрупп.МинимальнаяЧасть
		|			И ВТРаспред.СтруктурнаяЕдиница_Подразделение = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Подразделение
		|			И ВТРаспред.ВидСубконто1 = ВТ_РаспредГрупп.ВидСубконто1
		|			И ВТРаспред.ВидСубконто2 = ВТ_РаспредГрупп.ВидСубконто2
		|			И ВТРаспред.ВидСубконто3 = ВТ_РаспредГрупп.ВидСубконто3
		|			И ВТРаспред.СтруктурнаяЕдиница_Склад = ВТ_РаспредГрупп.СтруктурнаяЕдиница_Склад
		|			И ВТРаспред.Количество = ВТ_РаспредГрупп.Количество
		|			И ВТРаспред.Себистоимость = ВТ_РаспредГрупп.Себистоимость
		|			И ВТРаспред.Валюта = ВТ_РаспредГрупп.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРаспред.СтруктурнаяЕдиница_Подразделение,
		|	ВТРаспред.Характеристика,
		|	ВТРаспред.Ссылка,
		|	ВТРаспред.СуммаРасходов,
		|	ВТРаспред.Номенклатура,
		|	ВТРаспред.Организация,
		|	ВТРаспред.Период,
		|	ВТРаспред.ВидСубконто1,
		|	ВТРаспред.Валюта,
		|	ВТРаспред.СчетУчета,
		|	ВТРаспред.ВидСубконто3,
		|	ВТРаспред.Себистоимость,
		|	ВТРаспред.СтруктурнаяЕдиница_Склад,
		|	ВТРаспред.ВидСубконто2,
		|	ВТРаспред.Количество,
		|	ВТРаспред.СуммаПоСчету,
		|	ВТРаспред.СуммаГрупп,
		|	ВТРаспред.Коэф,
		|	ВТРаспред.ЧастьСуммы,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.МинимальнаяЧасть, 0) = 0
		|			ТОГДА ВТРаспред.ЧастьСуммы
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ВТРаспред.СуммаПоСчету - ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|							ТОГДА ВТРаспред.СуммаПоСчету
		|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|					КОНЕЦ = 0
		|					ТОГДА ВТ_РаспредГрупп.МинимальнаяЧасть
		|				ИНАЧЕ ВТ_РаспредГрупп.МинимальнаяЧасть + (ВТРаспред.СуммаПоСчету - ВЫБОР
		|						КОГДА ЕСТЬNULL(ВТ_РаспредГрупп.ЧастьСуммы, 0) = 0
		|							ТОГДА ВТРаспред.СуммаПоСчету
		|						ИНАЧЕ ВТ_РаспредГрупп.ЧастьСуммы
		|					КОНЕЦ)
		|			КОНЕЦ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасчетФинал.Номенклатура КАК Номенклатура,
		|	ВТ_РасчетФинал.Характеристика КАК Характеристика,
		|	ВТ_РасчетФинал.СчетУчета КАК СчетУчета,
		|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение,
		|	ВТ_РасчетФинал.СуммаПоСчетуРаспределение + ЕСТЬNULL(ВТ_РаспредГруппПроверка2.Разница, 0) КАК Сумма,
		|	ВТ_РаспредГруппПроверка2.Разница КАК Поле,
		|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница_Подразделение,
		|	ВТ_РасчетФинал.ВидСубконто1 КАК ВидСубконто1,
		|	ВТ_РасчетФинал.ВидСубконто2 КАК ВидСубконто2,
		|	ВТ_РасчетФинал.ВидСубконто3 КАК ВидСубконто3,
		|	ВТ_РасчетФинал.СтруктурнаяЕдиница_Склад КАК СтруктурнаяЕдиница_Склад,
		|	ВТ_РасчетФинал.Количество КАК Количество,
		|	ВТ_РасчетФинал.Себистоимость КАК Себистоимость,
		|	ВТ_РаспредГруппПроверка2.Себистоимость КАК СБ,
		|	ВТ_РасчетФинал.Валюта КАК Валюта,
		|	ВТ_РасчетФинал.Организация КАК Организация,
		|	ВТ_РасчетФинал.Период КАК Период,
		|	ВТ_РасчетФинал.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВременнаяТаблицаРаспределениеСумм
		|ИЗ
		|	ВТ_РасчетФинал КАК ВТ_РасчетФинал
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РаспредГруппПроверка2 КАК ВТ_РаспредГруппПроверка2
		|		ПО ВТ_РасчетФинал.СуммаПоСчетуРаспределение = ВТ_РаспредГруппПроверка2.МаксЧасть
		|			И ВТ_РасчетФинал.СчетУчета = ВТ_РаспредГруппПроверка2.СчетУчета
		|			И ВТ_РасчетФинал.Номенклатура = ВТ_РаспредГруппПроверка2.Номенклатура
		|			И ВТ_РасчетФинал.Характеристика = ВТ_РаспредГруппПроверка2.Характеристика
		|			И ВТ_РасчетФинал.Себистоимость = ВТ_РаспредГруппПроверка2.Себистоимость";
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов';en='income'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница_Подразделение КАК СтруктурнаяЕдиница,
	|	НЕОПРЕДЕЛЕНО КАК Заказ,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетУчета.СчетАналогУУ КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчетаРегл,
	|	НЕОПРЕДЕЛЕНО КАК Аналитика,
	|	&ОтражениеДоходов КАК СодержаниеПроводки,
	|	0 КАК СуммаДоходов,
	|	-ТаблицаДокумента.Сумма КАК СуммаРасходов,
	|	-ТаблицаДокумента.Сумма КАК Сумма
	|ИЗ
	|	ВременнаяТаблицаРаспределениеСумм КАК ТаблицаДокумента
	|ГДЕ
	|	НЕ ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.НезавершенноеПроизводство)
	|	И НЕ ТаблицаДокумента.СчетУчета.СчетАналогУУ.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.КосвенныеЗатраты)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	1,
	|	ТаблицаДокумента.Период,
	|	ТаблицаДокумента.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаДокумента.НаправлениеДеятельности,
	|	ТаблицаДокумента.СчетПереоценки,
	|	ТаблицаДокумента.СчетПереоценкиРегл,
	|	ТаблицаДокумента.ВнеоборотныйАктив,
	|	&ОтражениеДоходов,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА 0 Иначе ТаблицаДокумента.РазницаСтоимости КОНЕЦ,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА -ТаблицаДокумента.РазницаСтоимости Иначе 0 КОНЕЦ,
	|	ВЫБОР КОГДА ТаблицаДокумента.РазницаСтоимости < 0 ТОГДА -ТаблицаДокумента.РазницаСтоимости Иначе ТаблицаДокумента.РазницаСтоимости КОНЕЦ
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДоходыИРасходы = РегистрыНакопления.ДоходыИРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", ТаблицаДоходыИРасходы);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СтруктураДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Активность = Истина;
	КонецЦикла; 
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СодержаниеПроводки", НСтр("ka='Модернизация имущества';ru='Модернизация имущества';en='modernization of the property'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.РазницаСтоимости КАК Стоимость,
	|	0 КАК Амортизация,
	|	&СодержаниеПроводки
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВнеоборотныеАктивы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаРасспределениеЗатратНаТовары, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	1 КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.ПрименитьВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл
	|ИЗ
	|	ВременнаяТаблицаИмущество КАК ТаблицаДокумента";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()
